#### pandas data 호출

In [2]:
import numpy as np
import pandas as pd

In [8]:
path = 'C:/Users/tmznq/workspace/ml_scratch/dataset/titanic/train.csv'
path2 = 'C:/Users/tmznq/workspace/ml_scratch/dataset/titanic/test.csv'
path3 = 'C:/Users/tmznq/workspace/ml_scratch/dataset/titanic/gender_submission.csv'
df = pd.read_csv(path)
df2 = pd.read_csv(path2)
df3 = pd.read_csv(path3)

df3.head()

   PassengerId  Survived
0          892         0
1          893         1
2          894         0
3          895         0
4          896         1

#### 과제 1 : titanic 데이터에서 'Age' column을 bin으로 나누기
- label = ['청소년', '청년', '중년', '장년']
- bins = 3

#### 과제 2 : titanic 데이터 random sampling으로 다시 train, test 2개로 나누기
- np.permutation() 혹은 np.random.randint() 사용
- train 대 test의 비율은 8 대 2

In [87]:
df.shape

(891, 12)

In [88]:
sampler = np.random.permutation(20)
sampler

array([12,  8,  1, 17, 13,  9,  5,  3,  7, 18, 15,  4,  6, 19,  0, 11, 10,
       14,  2, 16])

In [89]:
i = round(sampler.size * 0.8)
train_idx = sampler[:i]
test_idx = sampler[i:]

In [90]:
train_idx = df.iloc[train_idx]
train_idx

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,13,0,3,"Saundercock, Mr. William Henry",male,청소년,0,0,A/5. 2151,8.0500,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,청년,0,2,347742,11.1333,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,청년,1,0,PC 17599,71.2833,C85,C
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,244373,13.0000,NaN,S
13,14,0,3,"Andersson, Mr. Anders Johan",male,청년,1,5,347082,31.2750,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,청소년,1,0,237736,30.0708,NaN,C
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,청년,1,0,113803,53.1000,C123,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,청소년,3,1,349909,21.0750,NaN,S
18,19,0,3,"Vander Planke, Mrs. Julius (Emelia Maria Vande...",female,청년,1,0,345763,18.0000,NaN,S
15,16,1,2,"Hewlett, Mrs. (Mary D Kingcome)",female,중년,0,0,248706,16.0000,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,청년,0,0,373450,8.0500,NaN,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,중년,0,0,17463,51.8625,E46,S
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,2649,7.2250,NaN,C
0,1,0,3,"Braund, Mr. Owen Harris",male,청년,1,0,A/5 21171,7.2500,NaN,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,중년,0,0,113783,26.5500,C103,S

In [91]:
test_idx = df.iloc[test_idx]
test_idx

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,청소년,1,1,PP 9549,16.7000,G6,S
14,15,0,3,"Vestrom, Miss. Hulda Amanda Adolfina",female,청소년,0,0,350406,7.8542,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,청년,0,0,STON/O2. 3101282,7.9250,NaN,S
16,17,0,3,"Rice, Master. Eugene",male,청소년,4,1,382652,29.1250,NaN,Q